#include "mainwindow.h"
#include "ui_mainwindow.h"
#include "newwindow.h"
#include "openwindow.h"
#include <QMessageBox>

MainWindow::MainWindow(QWidget *parent)
    : QMainWindow(parent)
    , ui(new Ui::MainWindow)
{
    ui->setupUi(this);
}

MainWindow::~MainWindow()
{
    delete ui;
}



void MainWindow::on_actionExit_triggered()
{
    QApplication::exit();
}


void MainWindow::on_pushButton_clicked()
{
    NewWindow *nw = new NewWindow;
    nw->show();
    this->hide();
}


void MainWindow::on_pushButtonOpen_clicked()
{
    OpenWindow *ow = new OpenWindow;
    ow->show();
    this->hide();
}


void MainWindow::on_actionOpen_triggered()
{
    on_pushButtonOpen_clicked();
}


void MainWindow::on_actionInfTree_triggered()
{
    QMessageBox::information(this, "Про дерева", "Дерево — структура даних, яка складається з вузлів (вершин) \
і ребер, без будь-яких циклів.\n\n"
"Бінарне дерево пошуку — це структура даних на основі вузлів, де кожен вузол містить ключ і два піддерева, лівий та правий. \
Для всіх вузлів ключ лівого піддерева повинен бути меншим ніж ключ вузла, а ключ правого піддерева повинен бути більшим ніж ключ вузла.\n\n"
"Висота дерева - довжина найдовшого шляху від кореня (вузла без батьківських елементів) до листя(вузла без дочірніх елементів).\n\n"
"Розмір дерева - кількість вузлів у ньому\n\n"
"Бінарне дерево пошуку є збалансованим, якщо різниця у висоті обох піддерев довільної вершини дерева дорівнює нулю або одиниці. \
Також дерево вважається ідельно збалансованим, якщо воно збалансоване, листя знаходяться на одному або двох рівнях \
та всі вузли останнього рівня знаходяться якомога лівіше");
}




void MainWindow::on_actionInfProg_triggered()
{
    QMessageBox::information(this, "Про роботу програми", "Суть роботи даної програми полягає в проведені операцій над бінарними деревами пошуку, зокрема з ідеально збалансованими деревами."
                             "На початку роботи програми необхідно створити новий проєкт, натиснувши кнопку \"Створити проєкт\", або відкрити вже існуючий,  натиснувши кнопку \"Відкрити проєкт\".\n"
                             "Вгорі розташовано панель меню, яке дозволяє відкрити існуючий проєкт, дізнатися більше про роботу програми та сутність дерева як структур даних та завершити роботу програми\n\n"
                             "У разі виникнення проблем, наприклад, помилки під час відкриття файлів, на екран виведеться відповідне відповідне повідомлення");
}
